app/controllers/api/v1/books_controller.rb

      def create
        @book = Book.new(book_params)
        if @book.save
---
INSERT INTO `books` (`title`, `author`, `synopsis`, `year`, `created_at`, `updated_at`) VALUES ('NOS4A2', 'Joel Hill', 'Los hijos de un abogado sureño afrontan prejuicios raciales cuando su padre defiende a un hombre negro inocente, acusado de haber violado a una mujer blanca.', '2013', '2020-07-15 08:16:14', '2020-07-15 08:16:14')

      def destroy
        @book.destroy
---
DELETE FROM `books` WHERE `books`.`id` = 2

        def set_book
          @book = Book.find(params[:id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1